#!/usr/bin/env python3

import os
import re
from os import listdir
from os.path import isfile, join
import config
import chunk_ctrl as cc
import argparse
import re
from pathlib import Path
import ollama

# Load settings from configuration file.
cfg = config.Config('html_to_md.cfg')
p = cfg['reference_docs_path'].split('/')
REF_DOCS_PATH = f'{p[0]}/{p[1]}'
TITLE_TAG = cfg['title_tag']
SOURCE_TAG = cfg['source_tag']
QUOTE_TAG = cfg['quote_tag']
CHUNKING = cfg['chunking']
DROP_WORDS = cfg['drop_words']
PARAGRAPH_TAG = 'paragraph'
PARAGRAPH_BORDER = '----paragraph_border----'
PAGE_HEADER_END = 'page_header_end'
PAGE_NUMBER_TAG = 'page_number'  # page number
END_OF_PAGE_TAG = 'end_of_page'
DOCUMENT = 'document'
PAGE_SEPARATOR = '<------------------page_separator-------------------->'
SENTENCE_SEPARATOR = '. ' 
STAB = 'blabla'

gost_19281_2014_tables_meta = [
    {
        "Название таблицы": "Таблица 1 - химический состав стали по анализу ковшевой пробы",
        "Класс прочности": ["265, 295", "315", "325", "345", "355", "375", "390", "440"],
        "Массовая доля элементов, %, не более": ["С", "Si", "Мn", "Р", "S", "Сr", "Ni", "Сu", "V", "N"]
    },
    {
        "Название таблицы": "Таблица 2 - механические свойства при испытании на растяжение сортового и фасонного проката",
        "Класс прочности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Размеры проката по сечению, мм": ["До 250,0 включ.", "До 160,0 включ.", "До 140,0 включ.", "До 50,0 включ.", "До 16,0 включ."],
        "Механические свойства, не менее": ["Предел текучести", "Временное сопротивление", "Относительное удлинение"],
        "Предел текучести , Н/мм": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Временное сопротивление , Н/мм": ["430", "440", "450", "480", "510", "530", "590"],
        "Относительное удлинение , %": ["21", "19"]
    },
    {
        "Название таблицы": "Таблица 3 - механические свойства при испытании на растяжение толстолистового, широкополосного универсального проката и гнутых профилей",
        "Класс прочности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Толщина продукции, мм": ["До", "Св.", "включ.", "160,0", "100,0", "60,0", "50,0"],
        "Механические свойства, не менее": ["Предел текучести , Н/мм", "Временное сопротивление , Н/мм", "Относительное удлинение , %"],
        "Предел текучести , Н/мм": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Временное сопротивление , Н/мм": ["430", "450", "490", "510", "590"],
        "Относительное удлинение , %": ["21", "20", "19"]
    }, 
    {
        "Название таблицы": "Таблица 4 - содержание таблицы",
        "Нормируемая характеристика": ["Ударная вязкость KCU при температуре испытания, °С:", "минус 20", "минус 30", "минус 40", "минус 50", "минус 60", "минус 70", "Ударная вязкость KCV при температуре испытания, °С:", "0", "минус 5*", "минус 20", "минус 40", "минус 60*", "Ударная вязкость KCU после механического старения при температуре испытания, °С:", "+20"],
        "Категория": ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20"]
    }, 
    {
        "Название таблицы": "Таблица 5 - ударная вязкость сортового и фасонного проката",
        "Класс проч-ности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Размеры проката по сечению, мм": ["До 20,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 100,0 включ.", "Св. 100,0 до 160,0 включ.", "Св. 160,0 до 250,0 включ.", "Менее 10,0", "От 10,0 до 20,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 60,0 включ.", "Св. 60,0 до 100,0 включ.", "Св. 100,0 до 160,0 включ.", "До 60,0 включ.", "Св. 60,0 до 140,0 включ.", "До 10,0 включ.", "Св.10,0 до 20,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 60,0 включ.", "Св. 60,0 до 140,0 включ.", "До 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 140,0 включ.", "До 140,0 включ.", "До 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 50,0 включ.", "До 10,0 включ.", "Св. 10,0 до 16,0 включ.", "Св. 16,0 до 20,0 включ.", "Св. 20,0 до 50,0 включ.", "До 16,0 включ."],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С": ["минус 20", "минус 30", "минус 40", "минус 50", "минус 60", "минус 70", "0", "минус 20", "минус 40", "После механического старения"],
        "После механического старения": ["29", "+", "34", "39"]
    },
    {
        "Название таблицы": "Таблица 5 - ударная вязкость сортового и фасонного проката",
        "Класс прочности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Размеры проката по сечению, мм": ["До 20,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 100,0 включ.", "Св. 100,0 до 160,0 включ.", "Св. 160,0 до 250,0 включ.", "Менее 10,0", "От 10,0 до 20,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 60,0 включ.", "Св. 60,0 до 100,0 включ.", "Св. 100,0 до 160,0 включ.", "До 60,0 включ.", "Св. 60,0 до 140,0 включ.", "До 10,0 включ.", "Св.10,0 до 20,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 60,0 включ.", "Св. 60,0 до 140,0 включ.", "До 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 140,0 включ.", "До 140,0 включ.", "До 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 50,0 включ.", "До 10,0 включ.", "Св. 10,0 до 16,0 включ.", "Св. 16,0 до 20,0 включ.", "Св. 20,0 до 50,0 включ.", "До 16,0 включ."],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С": ["-20", "-30", "-40", "-50", "-60", "-70", "0", "-20", "-40", "После механического старения"]
    },
    {
        "Название таблицы": "Таблица 6 - ударная вязкость толстолистового, широкополосного универсального проката и гнутых профилей",
        "Класс прочности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Толщина продукции, мм": ["Менее 5,0", "От 5,0 до 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 160,0 включ.", "Св. 10,0 до 32,0 включ.", "Св. 32,0 до 100,0 включ.", "Св. 100,0 до 160,0 включ.", "До 10,0 включ.", "Св. 10,0 до 60,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 60,0 включ.", "Св. 12,0 до 50,0 включ.", "Св. 50,0 до 100,0 включ.", "Менее 5,0", "Св. 5,0 до 10,0 включ.", "Св. 10,0 до 50,0 включ.", "Св. 50,0 до 100,0 включ.", "До 10,0 включ.", "Св. 10,0 до 50,0 включ.", "До 10,0 включ.", "Св. 10,0 до 15,0 включ.", "Св. 15,0 до 50,0 включ.", "До 10,0 включ.", "Св. 10,0 до 32,0 включ.", "Св. 32,0 до 50,0 включ."],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания KCU, °С": ["-20", "-30", "-40", "-50", "-60", "-70", "0", "-5", "-20", "-40", "-60"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания KCV, °С": ["0", "-20", "-40"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания KCU, после механического старения": ["29"]
    },
    {
        "Название таблицы": "Таблица 7 - химический состав стали по анализу ковшевой пробы",
        "Марка стали": ["Стали нелегированные качественные", "09Г2", "09Г2-1", "09Г2Д", "09Г2Д-1", "09ГСФЮ", "10Г2Б", "10Г2Б-1", "12Г2Б", "12Г2Б-1", "12Г2Ф", "12Г2Ф-1", "14Г2", "14Г2-1", "15ГФ", "15ГФ-1", "15Г2СФ", "15Г2СФ-1", "16ГС", "16ГС-1", "17ГС", "17ГС-1", "18Г2АФ", "18Г2АФ-1", "17Г1С", "17Г1С-1", "17Г1С-У", "17Г1С-У-1", "07ГФБ", "07ГФБ-1", "08ХМФчЮА", "09Г2С", "09Г2С-1", "09Г2СД", "09Г2СД-1", "09Г2ФБ", "09Г2ФБ-1", "10Г2С1", "10Г2С1Д", "10Г2БД", "10Г2БД-1", "10ХСНД", "10ХНДП", "10Г2ФБЮ", "10Г2ФБЮ-1", "12ГС", "12ГС-1", "12Г2ФД", "12Г2ФД-1", "12Г2С", "12Г2С-1", "12Г2СД", "12Г2СД-1", "12ГСБЮ", "12ГСБЮ-1", "13ХФЮ", "14Г2АФ", "14Г2АФ-1", "14Г2АФД", "14Г2АФД-1", "14ХГС", "15ГФД", "15ГФД-1", "15Г2АФД", "15Г2АФД-1", "15ХСНД", "15Г2СФД", "15Г2СФД-1", "16Г2АФ", "16Г2АФ-1", "16Г2АФД", "16Г2АФД-1", "18Г2АФД", "18Г2АФД-1", "20ФЮ", "Стали легированные"],
        "Массовая доля элементов, %": ["C", "Si", "Mn", "P", "S", "Cr", "Ni", "Cu", "V", "других элементов"]
    }, 
    {
        "Название таблицы": "Таблица 8 - предельные отклонения по химическому составу в продукции",
        "Наименование элемента": ["C", "Mn", "Si", "Cr", "Ni", "Cu", "S", "P", "N", "V", "Ti", "Nb", "Al", "B [для стали марки 10ХСНД с микролегированием (Ti+B)]"],
        "Предельные отклонения по массовой доле элементов, %": ["±0,02", "±0,10", "±0,05", "±0,05", "±0,05", "±0,05", "±0,005", "+0,005", "±0,005", "+0,02", "+0,010", "+0,010", "+0,010", "+0,0005"],
        "Наименование элемента_1": ["V", "Ti", "Nb", "Al"],
        "Предельные отклонения по массовой доле элементов, %_1": ["+0,02", "+0,010", "+0,010", "+0,010"],
        "Предельные отклонения по массовой доле элементов, %_2": ["-0,01", "-0,005", "-0,005", "-0,005"]
    }, 
    {
        "Название таблицы": "Таблица 9 - механические свойства при испытании на растяжение сортового и фасонного проката",
        "Класс прочности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Размеры проката по сечению, мм": ["До 250,0 включ.", "До 20,0 включ.", "Св. 20,0 до 160,0 включ.", "До 140,0 включ.", "До 50,0 включ.", "До 16,0 включ."],
        "Марка стали": ["09Г2С", "09Г2С-1", "09Г2СД", "09Г2СД-1", "12Г2С", "12Г2С-1", "12Г2СД", "12Г2СД-1", "12Г2Ф", "12Г2Ф-1", "12Г2ФД", "12Г2ФД-1", "09Г2", "09Г2-1", "09Г2Д", "09Г2Д-1", "10Г2С1", "10Г2С1Д", "14Г2", "14Г2-1", "15ГФ", "15ГФ-1", "15ГФД", "15ХСНД", "10ХСНД", "10ХНДП", "10Г2Б", "10Г2БД", "15Г2СФ", "15Г2СФ-1", "15Г2СФД", "15Г2СФД-1"],
        "Механические свойства, не менее": ["Предел текучести , Н/мм", "Временное сопротивление , Н/мм", "Относительное удлинение , %"],
        "Предел текучести , Н/мм": ["265", "305", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Временное сопротивление , Н/мм": ["430", "440", "430", "440", "450", "480", "480", "510", "530", "590"],
        "Относительное удлинение , %": ["21", "21", "21", "21", "21", "19"]
    }, 
    {
        "Название таблицы": "Таблица 10 - механические свойства при испытании на растяжение толстолистового, широкополосного универсального проката и гнутых профилей",
        "Класс прочности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Толщина продукции, мм": ["До 160,0 включ.", "До  20,0 включ.", "Св. 20,0 до 100,0 включ.", "Св. 100,0 до 160,0 включ.*", "До 60,0 включ.", "До 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 60,0 включ.", "До 50,0 включ.", "Св. 50,0 до 100,0 включ.*", "До 50,0 включ.", "До 50,0 включ.", "До 50,0 включ."],
        "Марка стали": ["09Г2С", "09Г2С-1", "09Г2СД", "09Г2СД-1", "16ГС", "16ГС-1", "09Г2", "09Г2-1", "09Г2Д", "09Г2Д-1", "10Г2С1", "10Г2С1Д", "17Г1С", "17Г1С-1", "12ГС", "12ГС-1", "14Г2", "14Г2-1", "15ГФ", "15ГФ-1", "15ГФД", "17ГС", "17ГС-1", "14ХГС", "15ХСНД", "10ХНДП", "10Г2Б", "10Г2Б-1", "10Г2БД", "10Г2БД-1", "10ХСНД", "14Г2АФ", "14Г2АФ-1", "14Г2АФД", "14Г2АФД-1", "15Г2АФД", "15Г2АФД-1", "15Г2СФ", "15Г2СФ-1", "15Г2СФД", "15Г2СФД-1", "16Г2АФ", "16Г2АФ-1", "16Г2АФД", "16Г2АФД-1", "18Г2АФ", "18Г2АФ-1", "18Г2АФД", "18Г2АФД-1"],
        "Механические свойства стали": ["Предел текучести", "Временное сопротивление", "Относительное удлинение"],
        "Предел текучести": ["265", "450", "305", "295", "315", "430", "325", "470", "490", "510"],
        "Временное сопротивление": ["430", "440", "450", "470", "490"],
        "Относительное удлинение": ["21", "26", "23", "20", "19"]
    },
    {
        "Название таблицы": "Таблица 11 - ударная вязкость сортового и фасонного проката",
        "Класс прочности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Размеры проката по сечению, мм": ["До 20,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 100,0 включ.", "Св. 100,0 до 250,0 включ.", "Менее 10,0", "От 10,0 до 20,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 100,0 включ.", "Св. 100,0 до 160,0 включ.", "До 60,0 включ.", "Св. 60,0 до 140,0 включ.", "Менее 5,0", "От 5,0 до 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 60,0 включ.", "Св. 60,0 до 140,0 включ.", "Менее 5,0", "От 5,0 до 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 140,0 включ.", "До 140,0 включ.", "До 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 50,0 включ.", "Менее 5,0", "От 5,0 до 10,0 включ.", "Св. 10,0 до 16,0 включ.", "Св. 16,0 до 20,0 включ.", "Св. 20,0 до 50,0 включ.", "До 16 включ."],
        "Марка стали": ["09Г2С", "09Г2С-1", "09Г2СД", "09Г2СД-1", "12Г2С", "12Г2С-1", "12Г2СД", "12Г2СД-1", "12Г2Ф", "12Г2Ф-1", "12Г2ФД", "12Г2ФД-1", "10Г2С1", "10Г2С1Д", "14Г2", "14Г2-1", "15ГФ", "15ГФ-1", "15ГФД", "15ХСНД", "09Г2", "09Г2-1", "09Г2Д", "09Г2Д-1", "10ХСНД", "10ХНДП", "10Г2Б", "10Г2БД", "12Г2ФД", "15Г2СФ", "15Г2СФ-1", "15Г2СФД", "15Г2СФД-1"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С": ["минус 20", "минус 30", "минус 40", "минус 50", "минус 60", "минус 70", "0", "минус 20", "минус 40", "После механического старения +20"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С (минус 20)": ["KCU"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С (минус 30)": ["KCU"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С (минус 40)": ["KCU"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С (минус 50)": ["KCU"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С (минус 60)": ["KCU"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С (минус 70)": ["KCU"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С (0)": ["KCV"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С (минус 20 после старения)": ["KCV"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С (минус 40 после старения)": ["KCV"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С (после механического старения +20)": ["KCU"]
    }, 
    {
        "Название таблицы": "Таблица 12 - ударная вязкость толстолистового, широкополосного универсального проката и гнутых профилей",
        "Класс прочности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Толщина продукции, мм": ["До 20,0 включ.", "Св. 20,0 до 160,0 включ.", "Менее 5,0", "От 5,0 до 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 100,0 включ.*", "Св. 100,0 до 160,0 включ.*", "До 10,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 60,0 включ.", "Св. 10,0 до 50,0 включ.*", "Св. 50,0 до 100,0 включ.*", "Св. 10,0 до 32,0 включ.", "Св. 32,0 до 50,0 включ.", "Св. 32,0 до 40,0 включ.", "Св. 40,0 до 50,0 включ.", "Св. 10,0 до 15,0 включ.", "Св. 15,0 до 32,0 включ."],
        "Марка стали": ["09Г2С", "09Г2С-1", "09Г2СД", "09Г2СД-1", "16ГС", "16ГС-1", "09Г2", "09Г2Д", "12ГС", "12ГС-1", "10Г2С1", "10Г2С1Д", "17Г1С", "17Г1С-1", "14Г2", "14Г2-1", "10ХНДП", "14ХГС", "15ХСНД", "17ГС", "17ГС-1", "15ГФ", "15ГФ-1", "15ГФД", "10Г2Б", "10Г2Б-1", "10Г2БД", "10Г2БД-1", "10ХСНД", "12Г2Б", "12Г2Б-1", "14Г2АФ", "14Г2АФ-1", "14Г2АФД", "14Г2АФД-1", "15Г2АФД", "15Г2АФД-1", "15Г2СФ", "15Г2СФ-1", "15Г2СФД", "15Г2СФД-1", "16Г2АФ", "16Г2АФ-1", "16Г2АФД", "16Г2АФД-1", "18Г2АФ", "18Г2АФ-1", "18Г2АФД", "18Г2АФД-1"],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С": ["-20 KCU", "-30 KCU", "-40 KCU", "-50 KCU", "-60 KCU", "-70 KCU", "0 KCV", "-20 KCV", "-40 KCV", "-60 KCV", "После механического старения +20 KCU"],
        "-20 KCU": ["39", "34", "34", "34*", "29"],
        "-30 KCU": ["34", "34*", "24"],
        "-40 KCU": ["34", "34*", "24"],
        "-50 KCU": ["34*", "34**", "24"],
        "-60 KCU": ["29", "34*", "24"],
        "-70 KCU": ["29"],
        "0 KCV": ["39", "34*", "34**"],
        "-20 KCV": ["39", "34*", "34**"],
        "-40 KCV": ["29", "34*", "34**"],
        "-60 KCV": ["29", "+", "-"],
        "После механического старения +20 KCU": ["29", "+", "-"]
    },
    {
        "Название таблицы": "Таблица а.1 - марки стали для сортового (круглого, квадратного, шестигранного и полосового) и фасонного проката",
        "Класс прочности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Размеры проката по сечению, мм": ["До 250,0 включ.", "До 32,0 включ.", "Св. 32,0 до 160,0 включ.", "До 140,0 включ.", "До 20,0 включ.", "Св. 10,0 до 140,0 включ.", "До 10,0 включ.", "До 50,0 включ.", "До 16,0 включ."],
        "Марки стали, обеспечивающие данный класс прочности": ["09Г2С, 09Г2С-1, 09Г2СД, 09Г2СД-1, 12Г2С, 12Г2С-1, 12Г2СД, 12Г2СД-1, 12Г2Ф, 12Г2Ф-1, 12Г2ФД, 12Г2ФД-1", "09Г2, 09Г2Д, 09Г2С, 09Г2С-1, 09Г2СД, 09Г2СД-1, 12Г2С, 12Г2С-1, 12Г2СД, 12Г2СД-1, 12Г2Ф, 12Г2Ф-1, 12Г2ФД, 12Г2ФД-1", "10Г2С1, 10Г2С1Д", "Марки стали согласовываются между изготовителем и потребителем", "14Г2, 14Г2-1, 15ГФ, 15ГФ-1, 15ГФД, 15ГФД-1, 15ХСНД", "10Г2С1, 10Г2С1Д", "09Г2*, 09Г2-1*, 09Г2С, 09Г2С-1, 09Г2СД, 09Г2СД-1, 10Г2С1, 10Г2С1Д, 10ХСНД, 10ХНДП, 12Г2С, 12Г2С-1, 12Г2СД, 12Г2СД-1, 12Г2Ф, 12Г2Ф-1, 12Г2ФД, 12Г2ФД-1, 15ХСНД", "09Г2С, 09Г2С-1, 09Г2СД, 09Г2СД-1, 12Г2С, 12Г2С-1, 12Г2СД, 12Г2СД-1, 12Г2Ф, 12Г2Ф-1, 12Г2ФД, 12Г2ФД-1, 15ГФ, 15ГФ-1, 15ГФД", "Марки стали согласовываются между изготовителем и потребителем", "09Г2С, 09Г2С-1, 09Г2СД, 09Г2СД-1, 10Г2Б, 10Г2БД, 10ХСНД, 12Г2С, 12Г2С-1, 12Г2СД, 12Г2СД-1, 12Г2Ф, 12Г2Ф-1, 12Г2ФД, 12Г2ФД-1, 15ГФ, 15ГФ-1, 15ГФД", "10ХСНД", "12Г2Ф, 12Г2Ф-1, 12Г2ФД, 12Г2ФД-1, 15Г2СФ, 15Г2СФ-1, 15Г2СФД, 15Г2СФД-1", "Марки стали согласовываются между изготовителем и потребителем"]
    },
    {
        "Название таблицы": "Таблица а.2 - марки стали для толстолистового, широкополосного универсального проката и гнутых профилей",
        "Класс прочности": ["265", "295", "315", "325", "345", "355", "375", "390", "440"],
        "Толщина продукции, мм": ["До 20,0 включ.", "Св. 20,0 до 160,0 включ.", "Св. 20,0 до 32,0 включ.", "Св. 32,0 до 100,0 включ.", "До 10,0 включ.", "От 10,0 до 20,0 включ.", "Св. 20,0 до 60,0 включ.", "Св. 10,0 до 20,0 включ.", "Св. 20,0 до 32,0 включ.", "До 32,0 включ.", "От 32,0 до 60,0 включ.", "До 50,0 включ.", "Св. 10,0 до 32,0 включ.", "Св. 32,0 до 50,0 включ.", "До 32,0 включ.", "До 40,0 включ.", "Св. 32,0 до 50,0 включ."],
        "Марки стали, обеспечивающие данный класс прочности при различных размерах продукции": ["09Г2С", "09Г2С-1", "09Г2СД", "09Г2СД-1", "16ГС", "16ГС-1", "09Г2", "09Г2-1", "09Г2Д", "09Г2Д-1", "10Г2С1", "10Г2С1Д", "12ГС", "12ГС-1", "17Г1С*", "17Г1С-1*", "15ГФ", "15ГФ-1", "15ГФД", "14Г2", "14Г2-1", "10ХНДП", "14ХГС", "15ХСНД", "17Г1С", "17Г1С-1", "09Г2С*", "14Г2АФ", "14Г2АФ-1", "14Г2АФД", "14Г2АФД-1", "17Г1С-У", "10Г2Б", "10Г2Б-1", "10Г2БД", "10Г2БД-1", "12Г2Б", "12Г2Б-1", "10Г2С1**", "14Г2**", "14Г2-1**", "15Г2АФД", "15Г2СФ", "15Г2СФ-1", "15Г2СФД", "15Г2СФД-1", "16Г2АФ", "16Г2АФ-1", "16Г2АФД", "16Г2АФД-1", "18Г2АФ", "18Г2АФ-1", "18Г2АФД", "18Г2АФД-1"]
    }, 
    {
        "Название таблицы": "Таблица б.1 - химический состав стали",
        "Обозна- чение группы и класса качества проката": ["S235JR, S235J0, S235J2", "S275JR, S275J0, S275J2", "S355JR, S355J0, S355J2"],
        "Массовая доля элементов, %": ["С", "С", "С", "Si", "Мn", "Р", "S", "N", "Cu", "AI"],
        "С, не более": ["0,17", "0,17", "0,20"],
        "номинальный диаметр проката, мм": ["До 16,0 включ.", "Св. 16,0 до 40,0 включ.", "Св. 40,0 до 180,0 включ."],
        "Si": ["0,55"],
        "Мn": ["1,40", "1,50", "1,60"],
        "Р": ["0,025"],
        "S": ["0,025"],
        "N": ["0,012"],
        "Cu": ["0,25"],
        "AI": ["0,020-0,050"]
    }, 
    {
        "Название таблицы": "Таблица б.2 - углеродный эквивалент",
        "Обозначение группы и класса качества проката": ["S235JR, S235J0, S235J2", "S275JR, S275J0, S275J2", "S355JR, S355J0, S355J2"],
        "Углеродный эквивалент , %, для проката номинального диаметра, мм": ["До 30,0 включ.", "Св. 30,0 до 40,0 включ.", "Св. 40,0 до 150,0 включ.", "Св. 150,0 до 180,0 включ."]
    },
    {
        "Название таблицы": "Таблица б.3 - механические свойства проката при испытании на растяжение",
        "Обозначение группы и класса качества проката": ["S235JR, S235J0, S235J2", "S275JR, S275J0, S275J2", "S355JR, S355J0, S355J2"],
        "Механические свойства, не менее": ["Предел текучести , Н/мм, для проката номинального диаметра, мм", "Временное сопротивление , Н/мм, для проката номинального диаметра, мм", "Относительное удлинение , %, для проката номинального диаметра, мм"],
        "Предел текучести , Н/мм, для проката номинального диаметра, мм": ["235", "225", "215", "195", "185", "275", "265", "255", "245", "235", "225", "215", "355", "345", "335", "325", "315", "295", "285"],
        "Временное сопротивление , Н/мм, для проката номинального диаметра, мм": ["360-", "510", "350-", "500", "340-", "490", "410-", "560", "400-", "540", "380-", "540", "470-", "630", "450-", "600", "450-", "600"],
        "Относительное удлинение , %, для проката номинального диаметра, мм": ["26", "25", "24", "22", "21", "23", "22", "21", "19", "18", "22", "21", "20", "18", "17"]
    },
    {
        "Название таблицы": "Таблица б.4 - механические свойства проката при испытании на ударный изгиб",
        "Обозначение группы и класса качества проката": ["S235JR", "S235J0", "S235J2", "S275JR", "S275J0", "S275J2", "S355JR", "S355J0", "S355J2"],
        "Температура испытания, °С": ["+20", "0", "минус 20"],
        "Работа удара, KV, Дж": ["27", "27", "27"],
        "Диаметр проката, мм": ["От 12,0 до 150,0 включ.", "Св.150,0 до 180,0 включ."]
    },
    {
        "Название таблицы": "Таблица б.5 - химический состав стали и углеродный эквивалент",
        "Класс прочности": ["460, 500", "550", "600", "620", "650, 700"],
        "Массовая доля элементов, %, не более": ["С", "Si", "Мn", "S", "Р", "Сr", "Ni", "V", "As", "N", "Других элементов, не более", "Углеродный эквивалент , %, не более"],
        "С": ["0,12", "0,12", "0,12", "0,12", "0,12"],
        "Si": ["0,50", "0,50", "0,50", "0,50", "0,50"],
        "Мn": ["1,90", "1,90", "1,90", "1,90", "2,10"],
        "S": ["0,035", "0,035", "0,035", "0,035", "0,035"],
        "Р": ["0,030", "0,030", "0,030", "0,030", "0,030"],
        "Сr": ["0,60", "0,60", "0,60", "0,60", "0,60"],
        "Ni": ["1,00", "1,00", "1,00", "1,00", "1,00"],
        "V": ["0,20", "0,20", "0,20", "0,20", "0,20"],
        "As": ["0,080", "0,080", "0,080", "0,080", "0,080"],
        "N": ["0,012", "0,012", "0,012", "0,012", "0,012"],
        "Других элементов, не более": ["AI - 0,050; Ti - 0,15; Nb - 0,10; Mo - 0,70", "Al - 0,050; Ti - 0,15; Nb - 0,10; Mo - 0,70", "Al - 0,050; Ti - 0,15; Nb - 0,10; Mo - 0,70", "Al - 0,050; Ti - 0,22; Nb - 0,10; Mo - 0,70", "Al - 0,050; Ti - 0,22; Nb - 0,10; Mo - 0,70"],
        "Углеродный эквивалент , %, не более": ["0,47", "0,50", "0,55", "0,57", "0,60"]
    },
    {
        "Название таблицы": "Таблица б.6 - механические свойства при испытании на растяжение и условия испытания на изгиб",
        "Класс прочности": ["460", "500", "550", "600", "620", "650", "700"],
        "Толщина проката по данному классу прочности, мм, не более": ["50"],
        "Механические свойства": ["Предел текучести", "Временное сопротивление", "Относительное удлинение"],
        "Предел текучести": ["460", "500", "550", "600", "620", "650", "700"],
        "Временное сопротивление": ["540-720", "550-770", "600-820", "650-870", "670-890", "700-890", "750-940"],
        "Относительное удлинение": ["17", "15", "14", "13", "12"],
        "Изгиб на угол до 90° (на поперечных образцах), а - толщина образца, d - диаметр оправки": ["d=3a"]
    },
    {
        "Название таблицы": "Таблица б.7 - ударная вязкость",
        "Класс прочности": ["460", "500", "560", "600", "620", "650", "700"],
        "Толщина продукции, мм": ["До 10,0 включ.", "Св. 10,0 до 32,0 включ.", "Св. 32,0 до 50,0 включ."],
        "Ударная вязкость, Дж/см, не менее, при температуре испытания, °С": ["+20", "минус 20", "минус 30", "минус 40", "минус 50", "минус 60", "минус 70", "0", "После механического старения +20"],
        "+20": ["+", "44", "39"],
        "минус 20": ["44", "39"],
        "минус 30": ["44", "39"],
        "минус 40": ["34", "29"],
        "минус 50": ["34", "29"],
        "минус 60": ["34", "29"],
        "минус 70": ["+"],
        "0": ["29"],
        "После механического старения +20": ["29"]
    },
    {
        "Название таблицы": "Таблица б.8 - химический состав стали",
        "Марка стали": ["16Х2ГСБ"],
        "Массовая доля элементов, %": ["C", "Si", "Mn", "Cr", "Nb", "S", "Р"],
        "C": ["0,14-0,18"],
        "Si": ["0,30-0,70"],
        "Mn": ["0,50-0,90"],
        "Cr": ["1,10-1,60"],
        "Nb": ["0,03-0,06"],
        "S": ["0,010"],
        "Р": ["0,015"]
    },
    {
        "Название таблицы": "Таблица б.9 - механические свойства",
        "Класс прочности": ["500", "600"],
        "Механические свойства": ["Временное сопротивление , Н/мм", "Предел текучести , Н/мм", "Относительное удлинение , %", "Ударная вязкость, Дж/см", "Ударная вязкость, Дж/см"],
        "Временное сопротивление , Н/мм": ["590-830", "690-930"],
        "Предел текучести , Н/мм": ["490-735", "590-835"],
        "Относительное удлинение , %": ["15", "14"],
        "Ударная вязкость, Дж/см KCU<sup>\-40</sup>": ["39", "39"],
        "Ударная вязкость, Дж/см KCV<sup>\-40</sup> ": ["29", "29"]
    }
]

gost_14637_89_tables_meta = [
{
"Название таблицы": "Таблица 1 - нормируемых характеристик стали",
"Нормируемая характеристика": ["Химический состав", "Механические свойства", "Ударная вязкость"],
"Ударная вязкость": ["при растяжении и изгибе до параллельности сторон", "при температуре, °С (+20)", "при температуре, °С (-20)", "при температуре, °С (-40)", "после механического старения", "при температуре, °С (0)", "при температуре, °С (+20)"],
"Механические свойства": ["Химический состав"],
"Категория": ["1", "2", "3", "4", "5", "6"],
"Марка стали": ["Ст0", "Ст2кп", "Ст2пс", "Ст2сп", "Ст3кп", "Ст3пс", "Ст3сп", "Ст3Гпс", "Ст3Гсп", "Ст4пс", "Ст4сп", "Ст5пс", "Ст5сп", "Ст5Гпс"]
},
{
"Название таблицы": "Таблица 2 - Категории проката в зависимости от нормируемых характеристик",
"Марка стали": ["Ст0", "Ст2кп", "Ст2пс, Ст2сп", "Ст3кп", "Ст3пс, Ст3сп", "Ст3Гпс", "Ст3Гсп", "Ст4пс, Ст4сп", "Ст5пс, Ст5сп", "Ст5Гпс"],
"Временное сопротивление, Н/мм2 (кгс/ мм2)": ["Не менее 300(31)", "320-410(33-42)", "330-430(34-44)", "360-460(37-47)", "370-480(38-49)", "370-490(38-50)", "390-570(40-58)", "410-530(42-54)", "490-630(50-64)", "450-590(46-60)"],
"Предел текучести, Н/мм2 (кгс/ мм2), для толщин, мм": ["215(22)", "225(23)", "235(24)", "245(25)", "255(26)", "265(27)", "285(29)"],
"Предел текучести, Н/мм2 (кгс/ мм2), для толщин, мм.1": ["205(21)", "215(22)", "225(23)", "235(24)", "245(25)", "255(26)", "275(28)"],
"Предел текучести, Н/мм2 (кгс/ мм2), для толщин, мм.2": ["195(20)", "205(21)", "215(22)", "225(23)", "235(24)", "245(25)", "265(27)"],
"Предел текучести, Н/мм2 (кгс/ мм2), для толщин, мм.3": ["185(19)", "195(20)", "205(21)", "215(22)", "225(23)", "235(24)", "255(26)"],
"Относительное удлинение, %, для толщин, мм": ["23", "33", "32", "27", "26", "25", "24", "24", "20"],
"Относительное удлинение, %, для толщин, мм.1": ["22", "32", "31", "26", "25", "24", "23", "23", "19"],
"Относительное удлинение, %, для толщин, мм.2": ["20", "30", "29", "24", "23", "22", "-", "21", "17"],
"Изгиб до параллельности сторон ( - толщина образца, -диаметр оправки) для толщин,": ["=2,5", "=3,5", "=1,5", "=2,5", "=2,5", "=3,5", "=3,5", "=4,5"],
"Изгиб до параллельности сторон ( - толщина образца, -диаметр оправки) для толщин, .1": ["-", "-", "-", "-", "-", "-", "-", "-"]
},
{
"Название таблицы": "Таблица 3 - Ударная вязкость стали",
"Марка": ["Ст3пс,", "Ст3сп", "Ст3Гпс", "Ст3Гсп", "Ст4пс,", "Ст4сп"],
"Толщина стали проката, мм": ["5-9", "10-25", "26-40", "10-30", "31-40"],
"Ударная вязкость KCU, Дж/см2 (кгс·м/см2)": ["при температуре, °С", "при температуре, °С", "после механического"],
"при температуре, °С +20": ["78(8)", "69(7)", "49(5)", "59(6)", "39(4)"],
"при температуре, °С -20": ["39(4)", "29(3)", "-"],
"после механического старения": ["39(4)", "29(3)"]
},
{
"Название таблицы": "Таблица 4 - механические свойства проката",
"Толщина проката, мм": ["до 20", "21-40"],
"Временное сопротивление, Н/мм2 (кгс/мм2)": ["430(44)"],
"Предел текучести, Н/мм2 (кгс/мм2)": ["295(30)"],
"Относительное удлинение, %": ["16"],
"Ударная вязкость KCU, Дж/см2  (кгс·м/см2)": ["39(4)", "29(3)"],
"Изгиб до параллельности сторон (- толщина, диаметр оправки)": ["=4", "=5"]
},
{
"Название таблицы": "Таблица 5 - Нормы ударной вязкости KCV проката категорий 5 и 6",
"Категория": ["5", "6"],
"Толщина проката, мм": ["5-20", "Св. 20", "8-9", "10-20"],
"Ударная вязкость KCV, Дж/см2 (кгс·м/см2) при температуре, °С": ["+20", "0"],
"+20": ["34(3,5)", "-"],
"0": ["-", "34(3,5)", "30(3,1)"]
},
{
"Название таблицы": "Таблица 6 - Объем выборки для проверки качества",
"Вид проката": ["Лист", "Рулон"],
"Объем выборки проката горячекатаного и упрочненного (кроме термообработанного)": ["Два листа", "Один рулон"],
"Объем выборки проката термообработанного": ["Один лист (из середины садки)", "Один рулон"]
}
]


def build_txt(make_tables_description: bool = False, make_tags: bool = False, add_metatables: bool = False) -> int:
    files = [f for f in listdir(REF_DOCS_PATH) if isfile(join(REF_DOCS_PATH, f))]
    c = 0
    for path in files:
        if path.endswith(".md"):
            c += 1
    print(f"{c} gost md files found.")
    for path in files:
        relative_path = REF_DOCS_PATH + '/' + path
        filename = os.path.abspath(relative_path)
        extentions = filename.split(".")

        # Игнорируем не md-файлы.
        if extentions[-1] != "md":
            continue
        if "_chunked" in filename:
            continue
        with open(filename, "r", encoding="utf-8") as f:
            md = f.read()
        
        # Регулярное выражение для поиска строк, начинающихся с 'Таблица'
        #  и заканчивающихся двумя и более символами новой строки
        #pattern = r'(^Таблица.*?)\n\n'
        pattern = r'(^Таблица.*?)\n{2,}'
        # Замена двойных символов новой строки после строки с названием
        # таблицы на одинарный
        md = re.sub(pattern, r'\1\n', md, flags=re.DOTALL | re.MULTILINE)

        splitted_md = md.split('\n\n')

        # Первая строчка документа должна содержать его название.
        document_name = splitted_md[0]
        gost_num, gost_year = cc.read_gost_number_year(document_name)
        
        table_name = cc.UNNUMBERED_TABLE
        table_number = "undefined"
        bag = []
        for t in splitted_md:
            buf = ''
            buf = f'{buf}\n{cc.CHUNK_CUT}'
            res = t.strip()
            pattern = r'\x20{2,}'
            res = re.sub(pattern, ' ', res)
            pattern = r'\| ---'
            res = re.sub(pattern, '|---', res)
            pattern = r'--- \|'
            res = re.sub(pattern, '---|', res)
            pattern = r'\|\|'
            res = re.sub(pattern, '| |', res)
            pattern = r'\[.*?\]\(https?:\/\/.*?\s*\"?.*?\"\)'
            res = re.sub(pattern, 'ссылка', res)  # Удаляем гиперссылки.
            pattern = r'!\[.*?\]\(https?:\/\/.*?\)'
            res = re.sub(pattern, 'рисунок', res)  # Удаляем гиперссылки на рисунки.

            t_number, t_name = cc.extract_first_table_info(res)
            if t_number is not None:
                table_number = t_number.upper()
                table_name = t_name

            if '|---|' in res:
                chunk_type = cc.CHUNK_TYPE_TABLE_BODY
                t = cc.wrap_by_tag(table_number, cc.CHUNK_TABLE_NUMBER)
                t = f'{t}\n{res}'
                t = cc.wrap_by_tag(table_name, cc.CHUNK_TABLE_NAME)
                t = f'{t}\n{res}'
                # Двойной перенос необходим чтобы тэг
                # не оказался внутри таблицы.
                t = cc.wrap_by_tag(f'{t}\n', cc.CHUNK_TABLE)
                buf = f'{buf}\n{t}'
                metas = {'gost_num': gost_num, 'gost_year': gost_year,
                         'type': chunk_type, 'table_number': table_number}
                ids = f'table_{table_number}_body'
                table_name = cc.UNNUMBERED_TABLE
                table_number = "undefined"
            else:
                chunk_type = cc.CHUNK_TYPE_PARAGRAPH
                buf = f'{buf}\n{res}\n'
                metas = {'gost_num': gost_num, 'gost_year': gost_year,
                         'type': chunk_type}  
                ids = ''
                
            buf = cc.add_tag(buf, cc.CHUNK_META, f'{metas}')
            if len(ids) > 0:
                buf = cc.add_tag(buf, cc.CHUNK_IDS, f'{ids}')
            bag.append(buf)
        
        if add_metatables:
            if gost_num == '19281':
                for t in gost_19281_2014_tables_meta:
                    cc.add_table_meta(bag, t, gost_num, gost_year)
        
            if gost_num == '14637':
                for t in gost_14637_89_tables_meta:
                    cc.add_table_meta(bag, t, gost_num, gost_year)

        bulk = "\n".join(bag)
        print(bulk)

        chunks = bulk.split(cc.CHUNK_CUT)
        
        clean_bag = []
        for i, chunk in enumerate(chunks):
            s = chunk.strip()
            if len(s) > 0:
                s = s.replace('\n\n', '\n')
                clean_bag.append(s)

        for i, buf in enumerate(clean_bag):
            meta = cc.read_tag(buf, cc.CHUNK_META)
            buf = cc.remove_tag(buf, cc.CHUNK_META)
            ids = cc.read_tag(buf, cc.CHUNK_IDS)
            buf = cc.remove_tag(buf, cc.CHUNK_IDS)

            buf = (
                   f'{cc.BEGIN_TAG}\n'
                   f'<{cc.CHUNK_NUMBER} {i+1}>\n'
                   f'<{cc.CHUNK_SRC}>\n{document_name}'
                   f'\n</{cc.CHUNK_SRC}>'
                   f'\n<{cc.CHUNK_QUOTE}>'
                   f'\n{buf}'
                   f'\n</{cc.CHUNK_QUOTE}>\n')
            if len(meta) > 0:
                buf = cc.add_tag(buf, cc.CHUNK_META, meta)
            if len(ids) > 0:
                buf = cc.add_tag(buf, cc.CHUNK_IDS, ids)
            clean_bag[i] = buf

        table_descriptions = []
        for i, buf in enumerate(clean_bag):
            if cc.CHUNK_TABLE in buf:
                tn = cc.read_tag(buf, cc.CHUNK_TABLE_NAME)
                query = 'Этот текст содержит таблицу в формате "markdown".' \
                        " Выполни текстовое описание этой таблицы." \
                        f'Таблица:\n {buf}'

                if make_tables_description is True:
                    answer = ollama.generate(model=cc.MAIN_MODEL, prompt=query,
                                             stream=False)
                else:
                    answer = {}
                    answer['response'] = STAB

                res = answer['response']
                print('answer')
                desc = (
                        f'{cc.BEGIN_TAG}\n'
                        f'<description_of_{cc.CHUNK_NUMBER} {i+1}>\n'
                        f'<{cc.CHUNK_SRC}>\n{document_name}'
                        f'\n</{cc.CHUNK_SRC}>'
                        f'\n<{cc.CHUNK_QUOTE}>'
                        f'\n{tn}'
                        f'\n{res}'
                        f'\n</{cc.CHUNK_QUOTE}>\n')
                chunk_type = cc.CHUNK_TYPE_TABLE_DESCRIPTION
                table_description_metas = {'gost_num': gost_num, 'gost_year': gost_year,
                                           'type': chunk_type, 'table_number': '3'}
                desc = cc.add_tag(desc, cc.CHUNK_META, f'{table_description_metas}')
                table_descriptions.append(desc)
                print(desc)
        clean_bag.extend(table_descriptions)

        # Добавляем слова-теги.
        for i, chunk in enumerate(clean_bag):
            buf = cc.read_tag(chunk, cc.CHUNK_QUOTE)
            query = 'Это текст в формате "markdown". '\
                    " Опиши содержание этого текста тремя, четырмя ключевыми словами." \
                    " Если текст содержит таблицу, дополни список ключевых слов именем таблицы." \
                    " Твой ответ должен сожержать только ключевые слова рахделенные запятыми." \
                    f" Пример: металлургия, прокат, требования.\n Вот текст для анализа:\n {buf}"

            if make_tags is True:
                answer = ollama.generate(model=cc.MAIN_MODEL, prompt=query,
                                         stream=False)
            else:
                answer = {}
                answer['response'] = STAB
            res = answer['response']
            res = res.replace('Теги:', '')
            res = res.replace('Метки:', '')
            res = res.replace('Мета-метки:', '')
            res = res.replace('Ключевые слова:', '') 
            chunk = (
                   f'{chunk}'
                   f'\n<{cc.CHUNK_TAGS}>'
                   f'\n{res}'
                   f'\n</{cc.CHUNK_TAGS}>\n')
            print(chunk)
            clean_bag[i] = chunk

        md_filename = filename.replace(".md", "_chunked.md")
        with open(md_filename, "w", encoding="utf-8") as f:
            print(f'Write: {md_filename}')
            f.write("\n".join(clean_bag))


if __name__ == "__main__":
    # build_txt() # For generate without Ai-made descriptions.
    build_txt(make_tables_description=True, make_tags=True, add_metatables=True)
    # build_txt(add_metatables=True)
